# Mod11 Ufuncs in Pandas

## Ufuncs: Index Preservation

In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.__version__

'1.0.5'

In [3]:
np.__version__

'1.19.1'

In [4]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0, 10, 4))
ser

0    6
1    3
2    7
3    4
dtype: int64

In [5]:
ser.values

array([6, 3, 7, 4])

In [6]:
rng = np.random.RandomState(42)
df = pd.DataFrame(rng.randint(0, 10, (3, 4)),
                  columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  6  3  7  4
1  6  9  2  6
2  7  4  3  7

In [13]:
df.values

array([[6, 3, 7, 4],
       [6, 9, 2, 6],
       [7, 4, 3, 7]])

In [15]:
np.exp(ser)  #指數運算

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [16]:
np.exp(ser.values)  #指數運算

array([ 403.42879349,   20.08553692, 1096.63315843,   54.59815003])

In [17]:
np.exp(df)

             A            B            C            D
0   403.428793    20.085537  1096.633158    54.598150
1   403.428793  8103.083928     7.389056   403.428793
2  1096.633158    54.598150    20.085537  1096.633158

In [18]:
np.exp(df['A'])

0     403.428793
1     403.428793
2    1096.633158
Name: A, dtype: float64

In [19]:
np.exp(df[['B','D']])

             B            D
0    20.085537    54.598150
1  8103.083928   403.428793
2    54.598150  1096.633158

In [20]:
df

   A  B  C  D
0  6  3  7  4
1  6  9  2  6
2  7  4  3  7

In [21]:
np.exp(df[0:2])

            A            B            C           D
0  403.428793    20.085537  1096.633158   54.598150
1  403.428793  8103.083928     7.389056  403.428793

In [7]:
df.iloc[1]

A    6
B    9
C    2
D    6
Name: 1, dtype: int64

In [22]:
np.exp(df.iloc[1])

A     403.428793
B    8103.083928
C       7.389056
D     403.428793
Name: 1, dtype: float64

In [23]:
df.iloc[1].index

Index(['A', 'B', 'C', 'D'], dtype='object')

In [24]:
np.sin(df * np.pi / 4)

          A             B         C             D
0 -1.000000  7.071068e-01 -0.707107  1.224647e-16
1 -1.000000  7.071068e-01  1.000000 -1.000000e+00
2 -0.707107  1.224647e-16  0.707107 -7.071068e-01

Review NumPy ufunc

In [28]:
arr=np.arange(5)
arr

array([0, 1, 2, 3, 4])

In [26]:
np.exp(arr)

array([ 1.        ,  2.71828183,  7.3890561 , 20.08553692, 54.59815003])

In [27]:
ar2=np.zeros(5)
np.exp(arr,out=ar2,where=arr>3)

array([ 0.        ,  0.        ,  0.        ,  0.        , 54.59815003])

In [ ]:
ar2

## UFuncs: Index Alignment

### Index alignment in Series

In [8]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                  'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
                        'New York': 19651127}, name='population')

In [9]:
area

Alaska        1723337
Texas          695662
California     423967
Name: area, dtype: int64

In [10]:
population

California    38332521
Texas         26448193
New York      19651127
Name: population, dtype: int64

In [11]:
population / area
# The resulting array contains the union of indices of the two input arrays
# any missing values are filled in with NaN by default  !!空值出現!!

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [12]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])

In [35]:
A

0    2
1    4
2    6
dtype: int64

In [36]:
B

1    1
2    3
3    5
dtype: int64

In [37]:
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

explicit specification of the fill value for any elements in ``A`` or ``B`` that might be missing:

In [38]:
A.add(B, fill_value=0)     #用0來補空值

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

### Index alignment in DataFrame

In [18]:
rng = np.random.RandomState(42)
A = pd.DataFrame(rng.randint(0, 20, (2, 2)),
                 columns=list('AB'))
A

    A   B
0   6  19
1  14  10

In [19]:
rng = np.random.RandomState(42)
B = pd.DataFrame(rng.randint(0, 10, (3, 3)),
                 columns=list('BAC'))
B

   B  A  C
0  6  3  7
1  4  6  9
2  2  6  7

In [41]:
A + B

      A     B   C
0   9.0  25.0 NaN
1  20.0  14.0 NaN
2   NaN   NaN NaN

In [42]:
A.add(B,fill_value=0)

      A     B    C
0   9.0  25.0  7.0
1  20.0  14.0  9.0
2   6.0   2.0  7.0

fill with the mean of all values in ``A`` (computed by first stacking the rows of ``A``):

In [57]:
ar = np.array([[2,7,3],[1,9,2]])

In [56]:
ar.mean()

4.166666666666667

In [44]:
A

    A   B
0   6  19
1  14  10

In [43]:
A.mean()   # 預設為以欄平均

A    10.0
B    14.5
dtype: float64

In [46]:
A.mean(axis= 1)   # or (axis='columns') 改為以列平均

0    12.5
1    12.0
dtype: float64

In [20]:
A

    A   B
0   6  19
1  14  10

In [59]:
%timeit A.values.mean()

9.63 µs ± 51.8 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

In [22]:
A.stack()   # 把本來二維降為一維

0  A     6
   B    19
1  A    14
   B    10
dtype: int64

In [21]:
A.unstack()

A  0     6
   1    14
B  0    19
   1    10
dtype: int64

In [52]:
fill = A.stack().mean()
fill

12.25

In [60]:
%%timeit
fill = A.stack().mean()
fill

353 µs ± 6.57 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [53]:
fill = A.stack().mean()
A.add(B, fill_value=fill)

       A      B      C
0   9.00  25.00  19.25
1  20.00  14.00  21.25
2  18.25  14.25  19.25

In [ ]:
A.stack?

## Lab

<b>有兩個 Series 如下，求兩個 Series 的和，遇到 NaN 以零代替</b>

In [ ]:
s1 = pd.Series([8.6, -3.2, 6.1, 2.4], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-4.2, 7.3, -2.7, 5, 1.8],
               index=['a', 'c', 'e', 'f', 'g'])

In [ ]:
s1

In [ ]:
s2

<b>有兩個 DataFrame 如下，求兩個 DataFrame 的乘積，遇到 NaN 以 1 代替</b>

In [ ]:
np.random.seed(61)
df1 = pd.DataFrame(np.random.randint(10,size=12).reshape((3, 4)),
                   columns=list('abcd'))
df2 = pd.DataFrame(np.random.randint(20,size=20).reshape((4, 5)),
                   columns=list('abcde'))

In [ ]:
df1

In [ ]:
df2